swak4Foam/Examples/RegionSolvers/cavityWithHeater/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoPimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         200;

deltaT          0.01;

writeControl    runTime;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression on;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           0.3;

maxDeltaT       1;

libs (
    "libsimpleRegionSolvers.so"
    "libsimpleSwakFunctionObjects.so"
    "libswakFunctionObjects.so"
    //    "libswakTopoSources.so"
    "libswakSourceFields.so"
);

functions {
    solveLeftHeater {
        type heatConductionRegionSolver;
        meshRegion leftHeater;
    }
    solveRightHeater {
        type heatConductionRegionSolver;
        meshRegion rightHeater;
    }
    solvebottomHeater {
        type heatConductionRegionSolver;
        meshRegion bottomHeater;
    }
    // getTheSets {
    //     type loadTopoSets;
    //     region rightHeater;
    //     forceLoading true;
    //     loadCellSets true;
    //     loadFaceSets false;
    //     loadPointSets false;
    //     writeSets true;
    // }
    // coolT {
    //     type expressionField;
    //     fieldName TCooler;
    //     region rightHeater;
    //     autowrite yes;
    //     expression "time()<20 ? 300-time() : 280";
    // }
    // createCoolerSet {
    //     type manipulateCellSet;
    //     cellSetName coolRegion;
    //     region rightHeater;
    //     createMissing true;
    //     mask "mag(pos()-vector(0.15,0.05+0.05*sin(time()/20),0.005)) < 0.01";
    // }
    cavityTemperature {
        type swakExpression;
        valueType internalField;
        accumulations (
            min
            max
        );
        expression "T";
        verbose true;
    }
    cavityPressure {
        $cavityTemperature;
        expression "p";
    }
}

// ************************************************************************* //
